#### terraform plan every: ab80589
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
aws_dynamodb_table.spotify-dynamo-music: Refreshing state... [id=spotify-dynamo-music]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_iam_policy.lambda_dynamo_music: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]
aws_iam_role_policy_attachment.lambda_dynamo_music: Refreshing state... [id=lambda-invoke-role-20210628073423139200000001]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.spotify-dynamo-music must be replaced
-/+ resource "aws_dynamodb_table" "spotify-dynamo-music" {
      ~ arn              = "arn:aws:dynamodb:ap-northeast-1:554506578892:table/spotify-dynamo-music" -> (known after apply)
      ~ hash_key         = "UserId" -> "PlaylistId" # forces replacement
      ~ id               = "spotify-dynamo-music" -> (known after apply)
        name             = "spotify-dynamo-music"
      ~ range_key        = "PlaylistId" -> "TrackId" # forces replacement
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
        tags             = {
            "Environment" = "production"
            "Name"        = "spotify-dynamo-music"
        }
        # (4 unchanged attributes hidden)

      - attribute {
          - name = "UserId" -> null
          - type = "S" -> null
        }

      - global_secondary_index {
          - hash_key           = "PlaylistId" -> null
          - name               = "SpotifyDynamoMusicPlaylistIndex" -> null
          - non_key_attributes = [
              - "UserId",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - range_key          = "TrackId" -> null
          - read_capacity      = 1 -> null
          - write_capacity     = 1 -> null
        }

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      - ttl {
          - enabled = false -> null
        }
        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.lambda_dynamo_music will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamo_music" {
        id        = "arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy"
        name      = "lambda_dynamo_music-policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:BatchGetItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:Query",
                          - "dynamodb:Scan",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-northeast-1:554506578892:table/spotify-dynamo-music*"
                      - Sid      = "ReadWriteTable"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.java_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-06-28T15:19:08.500+0000" -> (known after apply)
      ~ source_code_hash               = "dEW3w29i7RrRdWXpowU+ZZRZA2DrPqcV2peulz1lMWs=" -> "tM2jLAZ45NjmDPE66R/y8/kbtAOqgz0RrVlb2KlMbRc="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*